# MeasureFromStructure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MeasureFromStructure Property
ParameterTypeId Class See Also
---
"Extend into wall (to core)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MeasureFromStructure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MeasureFromStructure As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MeasureFromStructure {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace